/**********************************************************************
   Реазизуйте очередь с помощью LinkedList со следующими методами:
   enqueue() - помещает элемент в конец очереди.
   dequeue() - возвращает первый элемент из очереди и удаляет его.
   first()   - возвращает первый элемент из очереди, не удаляя его
 ***********************************************************************/
package HomeWorks.HomeWork4;

public class H42_Queue_Linked {
    public static void main(String[] args) {

    }
}
