/**
 * Даны 2 строки.
 * Написать метод, который вернет true, если это строки являются изоморфными и
 * false, если нет.
 * Строки изоморфны, если одну букву в первом слове можно заменить на некоторую букву
 * во втором слове. При этом:
 * 1. Повторяющиеся буквы одного слова меняются на одну и ту же букву с сохранением
 *      порядка следования. Например, add - egg  изоморфны.
 * 2. Буква может не меняться, а остаться такой же. Например, note - code.
 *
 */

package Webinars.Webinar5;

public class W51_IsomorfeString {
    public static void main(String[] args) {

    }
}
